Revit 2027 API
CategoryNameMap.Erase Method
Removes a category with the specified name from the map.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual int Erase(
	string key
)
Public Overridable Function Erase (
	key As String
) As Integer
public:
virtual int Erase(
	String^ key
)
abstract Erase :
        key : string -> int
override Erase :
        key : string -> int
Parameters
key String
The name of the category to be erased.
Return Value
Int32
The number of categories that were erased from the map.
See Also
Reference
CategoryNameMap Class
Autodesk.Revit.DB Namespace